{
	"id": "oval:org.debian:def:209313915798044321892989917530146508983",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2023-52836 linux",
		"affected": {
			"family": "unix",
			"platform": "Debian GNU/Linux 12",
			"product": "linux"
		},
		"reference": [
			{
				"source": "CVE",
				"ref_id": "CVE-2023-52836",
				"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-52836"
			}
		],
		"description": "In the Linux kernel, the following vulnerability has been resolved:  locking/ww_mutex/test: Fix potential workqueue corruption  In some cases running with the test-ww_mutex code, I was seeing odd behavior where sometimes it seemed flush_workqueue was returning before all the work threads were finished.  Often this would cause strange crashes as the mutexes would be freed while they were being used.  Looking at the code, there is a lifetime problem as the controlling thread that spawns the work allocates the \"struct stress\" structures that are passed to the workqueue threads. Then when the workqueue threads are finished, they free the stress struct that was passed to them.  Unfortunately the workqueue work_struct node is in the stress struct. Which means the work_struct is freed before the work thread returns and while flush_workqueue is waiting.  It seems like a better idea to have the controlling thread both allocate and free the stress structures, so that we can be sure we don't corrupt the workqueue by freeing the structure prematurely.  So this patch reworks the test to do so, and with this change I no longer see the early flush_workqueue returns.",
		"debian": {}
	},
	"criteria": {
		"operator": "AND",
		"criterias": [
			{
				"operator": "OR",
				"criterias": [
					{
						"operator": "AND",
						"criterions": [
							{
								"test_ref": "oval:org.debian.oval:tst:2",
								"comment": "all architecture"
							},
							{
								"test_ref": "oval:org.debian.oval:tst:28350",
								"comment": "linux DPKG is earlier than 6.1.64-1"
							}
						]
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:org.debian.oval:tst:1",
				"comment": "Debian 12 is installed"
			}
		]
	}
}
