{
	"id": "oval:org.debian:def:73684781217242144597171159604673500669",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2024-38558 linux",
		"affected": {
			"family": "unix",
			"platform": "Debian GNU/Linux 12",
			"product": "linux"
		},
		"reference": [
			{
				"source": "CVE",
				"ref_id": "CVE-2024-38558",
				"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-38558"
			}
		],
		"description": "In the Linux kernel, the following vulnerability has been resolved:  net: openvswitch: fix overwriting ct original tuple for ICMPv6  OVS_PACKET_CMD_EXECUTE has 3 main attributes:  - OVS_PACKET_ATTR_KEY - Packet metadata in a netlink format.  - OVS_PACKET_ATTR_PACKET - Binary packet content.  - OVS_PACKET_ATTR_ACTIONS - Actions to execute on the packet.  OVS_PACKET_ATTR_KEY is parsed first to populate sw_flow_key structure with the metadata like conntrack state, input port, recirculation id, etc.  Then the packet itself gets parsed to populate the rest of the keys from the packet headers.  Whenever the packet parsing code starts parsing the ICMPv6 header, it first zeroes out fields in the key corresponding to Neighbor Discovery information even if it is not an ND packet.  It is an 'ipv6.nd' field.  However, the 'ipv6' is a union that shares the space between 'nd' and 'ct_orig' that holds the original tuple conntrack metadata parsed from the OVS_PACKET_ATTR_KEY.  ND packets should not normally have conntrack state, so it's fine to share the space, but normal ICMPv6 Echo packets or maybe other types of ICMPv6 can have the state attached and it should not be overwritten.  The issue results in all but the last 4 bytes of the destination address being wiped from the original conntrack tuple leading to incorrect packet matching and potentially executing wrong actions in case this packet recirculates within the datapath or goes back to userspace.  ND fields should not be accessed in non-ND packets, so not clearing them should be fine.  Executing memset() only for actual ND packets to avoid the issue.  Initializing the whole thing before parsing is needed because ND packet may not contain all the options.  The issue only affects the OVS_PACKET_CMD_EXECUTE path and doesn't affect packets entering OVS datapath from network interfaces, because in this case CT metadata is populated from skb after the packet is already parsed.",
		"debian": {}
	},
	"criteria": {
		"operator": "AND",
		"criterias": [
			{
				"operator": "OR",
				"criterias": [
					{
						"operator": "AND",
						"criterions": [
							{
								"test_ref": "oval:org.debian.oval:tst:2",
								"comment": "all architecture"
							},
							{
								"test_ref": "oval:org.debian.oval:tst:30638",
								"comment": "linux DPKG is earlier than 6.1.94-1"
							}
						]
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:org.debian.oval:tst:1",
				"comment": "Debian 12 is installed"
			}
		]
	}
}
