{
	"id": "oval:org.debian:def:18984184494488822677084033662240617595",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2024-38621 linux",
		"affected": {
			"family": "unix",
			"platform": "Debian GNU/Linux 12",
			"product": "linux"
		},
		"reference": [
			{
				"source": "CVE",
				"ref_id": "CVE-2024-38621",
				"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-38621"
			}
		],
		"description": "In the Linux kernel, the following vulnerability has been resolved:  media: stk1160: fix bounds checking in stk1160_copy_video()  The subtract in this condition is reversed.  The ->length is the length of the buffer.  The ->bytesused is how many bytes we have copied thus far.  When the condition is reversed that means the result of the subtraction is always negative but since it's unsigned then the result is a very high positive value.  That means the overflow check is never true.  Additionally, the ->bytesused doesn't actually work for this purpose because we're not writing to \"buf->mem + buf->bytesused\".  Instead, the math to calculate the destination where we are writing is a bit involved.  You calculate the number of full lines already written, multiply by two, skip a line if necessary so that we start on an odd numbered line, and add the offset into the line.  To fix this buffer overflow, just take the actual destination where we are writing, if the offset is already out of bounds print an error and return.  Otherwise, write up to buf->length bytes.",
		"debian": {}
	},
	"criteria": {
		"operator": "AND",
		"criterias": [
			{
				"operator": "OR",
				"criterias": [
					{
						"operator": "AND",
						"criterions": [
							{
								"test_ref": "oval:org.debian.oval:tst:2",
								"comment": "all architecture"
							},
							{
								"test_ref": "oval:org.debian.oval:tst:30483",
								"comment": "linux DPKG is earlier than 6.1.94-1"
							}
						]
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:org.debian.oval:tst:1",
				"comment": "Debian 12 is installed"
			}
		]
	}
}
