{
	"id": "oval:org.debian:def:43979744953236561270075993697582719141",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2024-26646 linux",
		"affected": {
			"family": "unix",
			"platform": "Debian GNU/Linux 11",
			"product": "linux"
		},
		"reference": [
			{
				"source": "CVE",
				"ref_id": "CVE-2024-26646",
				"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-26646"
			}
		],
		"description": "In the Linux kernel, the following vulnerability has been resolved:  thermal: intel: hfi: Add syscore callbacks for system-wide PM  The kernel allocates a memory buffer and provides its location to the hardware, which uses it to update the HFI table. This allocation occurs during boot and remains constant throughout runtime.  When resuming from hibernation, the restore kernel allocates a second memory buffer and reprograms the HFI hardware with the new location as part of a normal boot. The location of the second memory buffer may differ from the one allocated by the image kernel.  When the restore kernel transfers control to the image kernel, its HFI buffer becomes invalid, potentially leading to memory corruption if the hardware writes to it (the hardware continues to use the buffer from the restore kernel).  It is also possible that the hardware \"forgets\" the address of the memory buffer when resuming from \"deep\" suspend. Memory corruption may also occur in such a scenario.  To prevent the described memory corruption, disable HFI when preparing to suspend or hibernate. Enable it when resuming.  Add syscore callbacks to handle the package of the boot CPU (packages of non-boot CPUs are handled via CPU offline). Syscore ops always run on the boot CPU. Additionally, HFI only needs to be disabled during \"deep\" suspend and hibernation. Syscore ops only run in these cases.  [ rjw: Comment adjustment, subject and changelog edits ]",
		"debian": {}
	},
	"criteria": {
		"operator": "AND",
		"criterias": [
			{
				"operator": "OR",
				"criterias": [
					{
						"operator": "AND",
						"criterions": [
							{
								"test_ref": "oval:org.debian.oval:tst:2",
								"comment": "all architecture"
							},
							{
								"test_ref": "oval:org.debian.oval:tst:29861",
								"comment": "linux DPKG is earlier than 0"
							}
						]
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:org.debian.oval:tst:1",
				"comment": "Debian 11 is installed"
			}
		]
	}
}
