{
	"id": "oval:org.debian:def:30150844481479885749956106525751317782",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2024-45818 xen",
		"affected": {
			"family": "unix",
			"platform": "Debian GNU/Linux 11",
			"product": "xen"
		},
		"reference": [
			{
				"source": "CVE",
				"ref_id": "CVE-2024-45818",
				"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-45818"
			}
		],
		"description": "The hypervisor contains code to accelerate VGA memory accesses for HVM guests, when the (virtual) VGA is in \"standard\" mode.  Locking involved there has an unusual discipline, leaving a lock acquired past the return from the function that acquired it.  This behavior results in a problem when emulating an instruction with two memory accesses, both of which touch VGA memory (plus some further constraints which aren't relevant here).  When emulating the 2nd access, the lock that is already being held would be attempted to be re-acquired, resulting in a deadlock.  This deadlock was already found when the code was first introduced, but was analysed incorrectly and the fix was incomplete.  Analysis in light of the new finding cannot find a way to make the existing locking discipline work.  In staging, this logic has all been removed because it was discovered to be accidentally disabled since Xen 4.7.  Therefore, we are fixing the locking problem by backporting the removal of most of the feature.  Note that even with the feature disabled, the lock would still be acquired for any accesses to the VGA MMIO region.",
		"debian": {}
	},
	"criteria": {
		"operator": "AND",
		"criterias": [
			{
				"operator": "OR",
				"criterias": [
					{
						"operator": "AND",
						"criterions": [
							{
								"test_ref": "oval:org.debian.oval:tst:2",
								"comment": "all architecture"
							},
							{
								"test_ref": "oval:org.debian.oval:tst:31885",
								"comment": "xen DPKG is earlier than 0"
							}
						]
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:org.debian.oval:tst:1",
				"comment": "Debian 11 is installed"
			}
		]
	}
}
