{
	"id": "oval:org.debian:def:91353396750762366372617586959297494360",
	"class": "vulnerability",
	"metadata": {
		"title": "CVE-2017-15705 spamassassin",
		"affected": {
			"family": "unix",
			"platform": "Debian GNU/Linux 11",
			"product": "spamassassin"
		},
		"reference": [
			{
				"source": "CVE",
				"ref_id": "CVE-2017-15705",
				"ref_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-15705"
			}
		],
		"description": "A denial of service vulnerability was identified that exists in Apache SpamAssassin before 3.4.2. The vulnerability arises with certain unclosed tags in emails that cause markup to be handled incorrectly leading to scan timeouts. In Apache SpamAssassin, using HTML::Parser, we setup an object and hook into the begin and end tag event handlers In both cases, the \"open\" event is immediately followed by a \"close\" event - even if the tag *does not* close in the HTML being parsed. Because of this, we are missing the \"text\" event to deal with the object normally. This can cause carefully crafted emails that might take more scan time than expected leading to a Denial of Service. The issue is possibly a bug or design decision in HTML::Parser that specifically impacts the way Apache SpamAssassin uses the module with poorly formed html. The exploit has been seen in the wild but not believed to have been purposefully part of a Denial of Service attempt. We are concerned that there may be attempts to abuse the vulnerability in the future.",
		"debian": {}
	},
	"criteria": {
		"operator": "AND",
		"criterias": [
			{
				"operator": "OR",
				"criterias": [
					{
						"operator": "AND",
						"criterions": [
							{
								"test_ref": "oval:org.debian.oval:tst:2",
								"comment": "all architecture"
							},
							{
								"test_ref": "oval:org.debian.oval:tst:11558",
								"comment": "spamassassin DPKG is earlier than 3.4.2-1"
							}
						]
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:org.debian.oval:tst:1",
				"comment": "Debian 11 is installed"
			}
		]
	}
}
